; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph0 - mode
	image1 - mode
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Star8 - direction
	Star6 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation0 - direction
	Star7 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star6)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star9)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star7)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star7)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star7)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation10)
)
(:goal (and
	(pointing satellite1 Star13)
	(have_image Planet11 image1)
	(have_image Planet12 thermograph0)
	(have_image Star13 image1)
	(have_image Planet14 thermograph0)
	(have_image Star15 image1)
))

)

; plan
1. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 6
2. (calibrate satellite3 instrument4 groundstation10)
   added: (calibrated instrument4)
   goals met: 0 of 6
3. (turn_to satellite3 planet14 groundstation10)
   deleted: (pointing satellite3 groundstation10)
   added: (pointing satellite3 planet14)
   goals met: 0 of 6
4. (take_image satellite3 planet14 instrument4 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 1 of 6
5. (turn_to satellite3 planet12 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet12)
   goals met: 1 of 6
6. (take_image satellite3 planet12 instrument4 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 2 of 6
7. (turn_to satellite3 planet11 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet11)
   goals met: 2 of 6
8. (take_image satellite3 planet11 instrument4 image1)
   added: (have_image planet11 image1)
   goals met: 3 of 6
9. (turn_to satellite1 star13 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star13)
   goals met: 4 of 6
10. (turn_to satellite3 star13 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 star13)
   goals met: 4 of 6
11. (take_image satellite3 star13 instrument4 image1)
   added: (have_image star13 image1)
   goals met: 5 of 6
12. (turn_to satellite3 star15 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star15)
   goals met: 5 of 6
13. (take_image satellite3 star15 instrument4 image1)
   added: (have_image star15 image1)
   goals met: 6 of 6
